evillgenius75/waveshare-airecorder/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Waveshare ESP32-S3-ePaper-3.97 (ESP32-S3-WROOM-1-N16R8): 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_MBEDTLS_X509_TRUSTED_CERT_CALLBACK=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Waveshare board: 16 MB QIO flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OTA-ready custom flash layout (16 MB).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Save the last crash to the coredump partition (read it with `idf.py coredump-info`).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Audio: ES8311 codec over the esp_codec_dev / esp_audio_codec managed components.
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# USB mass storage (OTG) exposes the SD card, per the board's USB-OTG storage mode.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Auto-sleep demo defaults for hardware validation.
CONFIG_FOLLOWUP_AUTO_SLEEP_DISPLAY_SLEEP_TIMEOUT_SECONDS=180
CONFIG_FOLLOWUP_AUTO_SLEEP_LIGHT_SLEEP_TIMEOUT_SECONDS=1800

# Internal RAM is tight on this board once Wi-Fi, the audio pipeline, and the
# recording/button/shutdown tasks are all live at boot; the Wi-Fi static RX
# buffer pool is the single largest easily-tunable internal-RAM consumer, so
# trim it (and RX_BA_WIN, which must stay <= 2x this value) from the stock
# defaults (10 / 6) to leave headroom for task creation later in startup.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=6
# Keep Wi-Fi code in flash rather than IRAM. On the S3, IRAM and DRAM share one SRAM pool,
# so this returns ~27 KB to the internal heap. With it, only ~16 KB was free when a
# transcription upload started, and hardware AES could not get its DMA buffers. The Wi-Fi
# throughput cost does not matter for this app's small uploads.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Wi-Fi and clock-sync demo defaults. Runtime NVS settings take precedence over
# these built-in station credentials.
CONFIG_FOLLOWUP_WIFI_AP_PREFIX="Followup"
CONFIG_FOLLOWUP_WIFI_STA_SSID=""
CONFIG_FOLLOWUP_WIFI_STA_PASSWORD=""
CONFIG_FOLLOWUP_WIFI_START_IN_AP_MODE=n
CONFIG_FOLLOWUP_TIME_SYNC_DEFAULT_ENABLED=y
CONFIG_FOLLOWUP_DEFAULT_TIMEZONE_NAME="North_America_Eastern"
CONFIG_FOLLOWUP_GEMINI_API_KEY=""

# SD card (SDMMC) long-filename support.
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LFN_STACK=n
CONFIG_FATFS_USE_LABEL=y
